# Python 결측 값 다루기

In [5]:
# PANDAS 패키지 불러오기
import pandas as pd
import numpy as np

In [6]:
sampleData = pd.read_excel("../dataset//missingValue.xlsx")
sampleData.head()

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [ ]:
filtered_df = df[df['name'].notnull()]

In [9]:
sampleData[   sampleData['product'].notnull() ]

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
3      A01  PRODUCT1     3  4.0     NaN

In [4]:
sampleData[   sampleData.qty.notnull()]

  regionid   product  week  qty  target
1      A01  PRODUCT1     2  2.0     NaN
3      A01  PRODUCT1     3  4.0     NaN

###  컬럼별 결측값 개수확인하기

In [3]:
sampleData.isnull().sum()

regionid    0
product     0
week        0
qty         2
target      2
dtype: int64

In [4]:
sampleData['qty'].isnull().sum()

2

In [5]:
sampleData.notnull().sum()

regionid    4
product     4
week        4
qty         2
target      2
dtype: int64

### 결측값 채우기

#### 1. 특정 값으로 채우기

In [7]:
aa = sampleData.fillna("")

In [8]:
aa

  regionid   product  week qty target
0      A01  PRODUCT1     1         20
1      A01  PRODUCT1     2   2
2      A01  PRODUCT1     3         10
3      A01  PRODUCT1     3   4

In [8]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

#### 2. 특정 순서로 채우기

In [9]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

### 백필 뒷부분 채우기

In [10]:
sampleData.fillna(method="bfill")

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  2.0    20.0
1      A01  PRODUCT1     2  2.0    10.0
2      A01  PRODUCT1     3  4.0    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [11]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [12]:
sampleData.fillna(method="ffill")

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0    20.0
2      A01  PRODUCT1     3  2.0    10.0
3      A01  PRODUCT1     3  4.0    10.0

#### 3. 평균 값으로 채우기

In [13]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [14]:
sampleData.fillna(sampleData.mean())

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01  PRODUCT1     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

In [15]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01  PRODUCT1     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [16]:
sampleData.where(pd.notnull(sampleData), sampleData.mean(), axis='columns')

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01  PRODUCT1     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

In [17]:
sampleData.fillna(sampleData.mean()['qty':'target'])

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01  PRODUCT1     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

#### 4. 다른 컬럼의 값으로 채우기

In [18]:
sampleData['new_qty'] = np.where(pd.notnull(sampleData['qty']) == True, 
                                 sampleData['qty'], sampleData['target'])
sampleData['new_target'] = np.where(pd.notnull(sampleData['target']) == True, sampleData['target'], 
                                    sampleData['qty'])
sampleData

  regionid   product  week  qty  target  new_qty  new_target
0      A01  PRODUCT1     1  NaN    20.0     20.0        20.0
1      A01  PRODUCT1     2  2.0     NaN      2.0         2.0
2      A01  PRODUCT1     3  NaN    10.0     10.0        10.0
3      A01  PRODUCT1     3  4.0     NaN      4.0         4.0

In [19]:
sampleData

  regionid   product  week  qty  target  new_qty  new_target
0      A01  PRODUCT1     1  NaN    20.0     20.0        20.0
1      A01  PRODUCT1     2  2.0     NaN      2.0         2.0
2      A01  PRODUCT1     3  NaN    10.0     10.0        10.0
3      A01  PRODUCT1     3  4.0     NaN      4.0         4.0